/**
 * @see https://www.mytcas.com/venues
 *
 * Use this
 * ```tsx
 * [...temp1.children].map(tr => tr.children).map(c => [c[1].textContent, c[2].textContent, c[3].textContent, c[4].textContent, c[5].textContent])
 * ```
 */
const locations = [
    [
        'โรงเรียนราชวินิต มัธยม',
        'สวนจิตรลดา',
        'เขตดุสิต',
        'กรุงเทพมหานคร',
        '900'
    ],
    [
        'โรงเรียนสาธิตจุฬาลงกรณ์มหาวิทยาลัย (ฝ่ายมัธยม)',
        'วังใหม่',
        'เขตปทุมวัน',
        'กรุงเทพมหานคร',
        '1080'
    ],
    ['โรงเรียนนนทรีวิทยา', 'ช่องนนทรี', 'เขตยานนาวา', 'กรุงเทพมหานคร', '900'],
    [
        'โรงเรียนศรีอยุธยา ในพระอุปถัมภ์ฯ',
        'ถนนพญาไท',
        'เขตราชเทวี',
        'กรุงเทพมหานคร',
        '1560 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนสันติราษฎร์วิทยาลัย',
        'ทุ่งพญาไท',
        'เขตราชเทวี',
        'กรุงเทพมหานคร',
        '1620'
    ],
    ['โรงเรียนวัดสุทธิวราราม', 'ยานนาวา', 'เขตสาทร', 'กรุงเทพมหานคร', '1410'],
    [
        'โรงเรียนเตรียมอุดมศึกษา',
        'ปทุมวัน',
        'เขตปทุมวัน',
        'กรุงเทพมหานคร',
        '3120 + 30 สำหรับผู้พิการ'
    ],
    ['โรงเรียนสารวิทยา', 'เสนานิคม', 'เขตจตุจักร', 'กรุงเทพมหานคร', '1800'],
    ['โรงเรียนหอวัง', 'จตุจักร', 'เขตจตุจักร', 'กรุงเทพมหานคร', '1800'],
    [
        'โรงเรียนดอนเมืองทหารอากาศบำรุง',
        'สีกัน',
        'เขตดอนเมือง',
        'กรุงเทพมหานคร',
        '1740'
    ],
    [
        'โรงเรียนวิมุตยารามพิทยากร',
        'บางอ้อ',
        'เขตบางพลัด',
        'กรุงเทพมหานคร',
        '600'
    ],
    ['โรงเรียนสตรีวิทยา ๒', 'ลาดพร้าว', 'เขตลาดพร้าว', 'กรุงเทพมหานคร', '1290'],
    ['โรงเรียนฤทธิยะวรรณาลัย', 'คลองถนน', 'เขตสายไหม', 'กรุงเทพมหานคร', '1800'],
    [
        'โรงเรียนราชวินิตบางเขน',
        'ทุ่งสองห้อง',
        'เขตหลักสี่',
        'กรุงเทพมหานคร',
        '1410'
    ],
    ['โรงเรียนเทพศิรินทร์ นนทบุรี', 'บางคูเวียง', 'บางกรวย', 'นนทบุรี', '1380'],
    ['โรงเรียนปากเกร็ด', 'ปากเกร็ด', 'ปากเกร็ด', 'นนทบุรี', '1620'],
    [
        'โรงเรียนสวนกุหลาบวิทยาลัย นนทบุรี',
        'ปากเกร็ด',
        'ปากเกร็ด',
        'นนทบุรี',
        '1350'
    ],
    ['โรงเรียนเบญจมราชานุสรณ์', 'ท่าทราย', 'เมืองนนทบุรี', 'นนทบุรี', '960'],
    ['โรงเรียนวัดเขมาภิรตาราม', 'สวนใหญ่', 'เมืองนนทบุรี', 'นนทบุรี', '1860'],
    ['โรงเรียนสตรีนนทบุรี', 'สวนใหญ่', 'เมืองนนทบุรี', 'นนทบุรี', '840'],
    ['โรงเรียนชุมแพศึกษา', 'ชุมแพ', 'ชุมแพ', 'ขอนแก่น', '1380'],
    ['โรงเรียนรร.เมืองพลพิทยาคม', 'ลอมคอม', 'พล', 'ขอนแก่น', '930'],
    ['โรงเรียนกัลยาณวัตร', 'ในเมือง', 'เมืองขอนแก่น', 'ขอนแก่น', '1650'],
    ['โรงเรียนแก่นนครวิทยาลัย', 'ในเมือง', 'เมืองขอนแก่น', 'ขอนแก่น', '1950'],
    ['โรงเรียนขอนแก่นวิทยายน', 'ในเมือง', 'เมืองขอนแก่น', 'ขอนแก่น', '1560'],
    ['โรงเรียนขามแก่นนคร', 'ศิลา', 'เมืองขอนแก่น', 'ขอนแก่น', '1590'],
    ['โรงเรียนบึงกาฬ', 'บึงกาฬ', 'เมืองบึงกาฬ', 'บึงกาฬ', '960'],
    ['โรงเรียนเลยพิทยาคม', 'กุดป่อง', 'เมืองเลย', 'เลย', '1560'],
    [
        'โรงเรียนธาตุนารายณ์วิทยา',
        'ธาตุเชิงชุม',
        'เมืองสกลนคร',
        'สกลนคร',
        '1350'
    ],
    [
        'โรงเรียนสกลราชวิทยานุกูล',
        'ธาตุเชิงชุม',
        'เมืองสกลนคร',
        'สกลนคร',
        '1800'
    ],
    ['โรงเรียนปทุมเทพวิทยาคาร', 'โพธิ์ชัย', 'เมืองหนองคาย', 'หนองคาย', '1200'],
    [
        'โรงเรียนหนองบัวพิทยาคาร',
        'หนองบัว',
        'เมืองหนองบัวลำภู',
        'หนองบัวลำภู',
        '990'
    ],
    ['โรงเรียนประจักษ์ศิลปาคาร', 'หนองบัว', 'เมืองอุดรธานี', 'อุดรธานี', '870'],
    ['โรงเรียนสตรีราชินูทิศ', 'หมากแข้ง', 'เมืองอุดรธานี', 'อุดรธานี', '1500'],
    [
        'โรงเรียนอุดรพิชัยรักษ์พิทยา',
        'หมากแข้ง',
        'เมืองอุดรธานี',
        'อุดรธานี',
        '1470'
    ],
    ['โรงเรียนอุดรพิทยานุกูล', 'หมากแข้ง', 'เมืองอุดรธานี', 'อุดรธานี', '1680'],
    [
        'โรงเรียนดำรงราษฎร์สงเคราะห์',
        'เวียง',
        'เมืองเชียงราย',
        'เชียงราย',
        '1920 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนสามัคคีวิทยาคม',
        'เวียง',
        'เมืองเชียงราย',
        'เชียงราย',
        '2250 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนกาวิละวิทยาลัย',
        'ท่าศาลา',
        'เมืองเชียงใหม่',
        'เชียงใหม่',
        '870 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนมงฟอร์ตวิทยาลัย',
        'ท่าศาลา',
        'เมืองเชียงใหม่',
        'เชียงใหม่',
        '2070 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนยุพราชวิทยาลัย',
        'ศรีภูมิ',
        'เมืองเชียงใหม่',
        'เชียงใหม่',
        '2100 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนวัฒโนทัยพายัพ',
        'หายยา',
        'เมืองเชียงใหม่',
        'เชียงใหม่',
        '1470 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนวารีเชียงใหม่',
        'หนองหอย',
        'เมืองเชียงใหม่',
        'เชียงใหม่',
        '1710 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนสตรีศรีน่าน',
        'ในเวียง',
        'เมืองน่าน',
        'น่าน',
        '1950 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนพะเยาพิทยาคม',
        'เวียง',
        'เมืองพะเยา',
        'พะเยา',
        '1800 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนนารีรัตน์จังหวัดแพร่',
        'ในเวียง',
        'เมืองแพร่',
        'แพร่',
        '1860 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนห้องสอนศึกษา ในพระอุปถัมภ์ฯ',
        'จองคำ',
        'เมืองแม่ฮ่องสอน',
        'แม่ฮ่องสอน',
        '990 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนบุญวาทย์วิทยาลัย',
        'หัวเวียง',
        'เมืองลำปาง',
        'ลำปาง',
        '1800 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนลำปางกัลยาณี',
        'สวนดอก',
        'เมืองลำปาง',
        'ลำปาง',
        '1650 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนจักรคำคณาทร จังหวัดลำพูน',
        'ในเมือง',
        'เมืองลำพูน',
        'ลำพูน',
        '1530 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนหอพระ',
        'ศรีภูมิ',
        'เมืองเชียงใหม่',
        'เชียงใหม่',
        '840 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนนวมินทราชูทิศ พายัพ',
        'ดอนแก้ว',
        'แม่ริม',
        'เชียงใหม่',
        '1140 + 30 สำหรับผู้พิการ'
    ],
    [
        'โรงเรียนส่วนบุญโญปถัมภ์ ลำพูน',
        'ในเมือง',
        'เมืองลำพูน',
        'ลำพูน',
        '1890 + 30 สำหรับผู้พิการ'
    ],
    ['โรงเรียนธัญบุรี', 'ประชาธิปัตย์', 'ธัญบุรี', 'ปทุมธานี', '1350'],
    ['โรงเรียนธัญรัตน์', 'รังสิต', 'ธัญบุรี', 'ปทุมธานี', '1710'],
    ['โรงเรียนสายปัญญารังสิต', 'ประชาธิปัตย์', 'ธัญบุรี', 'ปทุมธานี', '1620'],
    [
        'โรงเรียนคณะราษฎร์บำรุงปทุมธานี',
        'บ้านกลาง',
        'เมืองปทุมธานี',
        'ปทุมธานี',
        '960'
    ],
    ['โรงเรียนปทุมวิไล', 'บางปรอก', 'เมืองปทุมธานี', 'ปทุมธานี', '930'],
    [
        'โรงเรียนจอมสุรางค์อุปถัมภ์',
        'หอรัตนไชย',
        'พระนครศรีอยุธยา',
        'พระนครศรีอยุธยา',
        '990'
    ],
    [
        'โรงเรียนอยุธยานุสรณ์',
        'หัวรอ',
        'พระนครศรีอยุธยา',
        'พระนครศรีอยุธยา',
        '1140'
    ],
    [
        'โรงเรียนอยุธยาวิทยาลัย',
        'ประตูชัย',
        'พระนครศรีอยุธยา',
        'พระนครศรีอยุธยา',
        '1770'
    ],
    ['โรงเรียนสิงห์บุรี', 'บางมัญ', 'เมืองสิงห์บุรี', 'สิงห์บุรี', '750'],
    [
        'โรงเรียนอ่างทองปัทมโรจน์วิทยาคม',
        'บ้านอิฐ',
        'เมืองอ่างทอง',
        'อ่างทอง',
        '2250'
    ],
    ['โรงเรียนสตรีอ่างทอง', 'ศาลาแดง', 'เมืองอ่างทอง', 'อ่างทอง', '1770'],
    [
        'โรงเรียนวิสุทธรังษี จังหวัดกาญจนบุรี',
        'ท่าล้อ',
        'ท่าม่วง',
        'กาญจนบุรี',
        '1260'
    ],
    [
        'โรงเรียนกาญจนานุเคราะห์',
        'บ้านเหนือ',
        'เมืองกาญจนบุรี',
        'กาญจนบุรี',
        '1500'
    ],
    [
        'โรงเรียนรัตนโกสินทร์สมโภชบวรนิเวศศาลายา ในพระสังฆราชูปถัมภ์',
        'ศาลายา',
        'พุทธมณฑล',
        'นครปฐม',
        '750'
    ],
    ['โรงเรียนพระปฐมวิทยาลัย', 'พระปฐมเจดีย์', 'เมืองนครปฐม', 'นครปฐม', '1710'],
    ['โรงเรียนราชินีบูรณะ', 'พระปฐมเจดีย์', 'เมืองนครปฐม', 'นครปฐม', '1290'],
    ['โรงเรียนศรีวิชัยวิทยา', 'วังตะกู', 'เมืองนครปฐม', 'นครปฐม', '1230'],
    ['โรงเรียนวัดไร่ขิงวิทยา', 'ไร่ขิง', 'สามพราน', 'นครปฐม', '900'],
    [
        'โรงเรียนประจวบวิทยาลัย',
        'ประจวบคีรีขันธ์',
        'เมืองประจวบคีรีขันธ์',
        'ประจวบคีรีขันธ์',
        '1620'
    ],
    [
        'โรงเรียนเบญจมเทพอุทิศจังหวัดเพชรบุรี',
        'คลองกระแชง',
        'เมืองเพชรบุรี',
        'เพชรบุรี',
        '2070'
    ],
    ['โรงเรียนรัตนราษฎร์บำรุง', 'บ้านโป่ง', 'บ้านโป่ง', 'ราชบุรี', '1020'],
    [
        'โรงเรียนเบญจมราชูทิศ ราชบุรี',
        'หน้าเมือง',
        'เมืองราชบุรี',
        'ราชบุรี',
        '2160'
    ],
    ['โรงเรียนถาวรานุกูล', 'แม่กลอง', 'เมืองสมุทรสงคราม', 'สมุทรสงคราม', '900'],
    ['โรงเรียนสมุทรสาครบูรณะ', 'มหาชัย', 'เมืองสมุทรสาคร', 'สมุทรสาคร', '1980'],
    [
        'โรงเรียนกรรณสูตศึกษาลัย',
        'รั้วใหญ่',
        'เมืองสุพรรณบุรี',
        'สุพรรณบุรี',
        '1710'
    ],
    [
        'โรงเรียนสงวนหญิง',
        'ท่าพี่เลี้ยง',
        'เมืองสุพรรณบุรี',
        'สุพรรณบุรี',
        '960'
    ],
    ['โรงเรียนปทุมคงคา', 'พระโขนง', 'เขตคลองเตย', 'กรุงเทพมหานคร', '600'],
    [
        'โรงเรียนสายน้ำผึ้ง ในพระอุปถัมภ์ ฯ',
        'คลองเตย',
        'เขตคลองเตย',
        'กรุงเทพมหานคร',
        '600'
    ],
    [
        'โรงเรียนกุนนทีรุทธารามวิทยาคม',
        'ดินแดง',
        'เขตดินแดง',
        'กรุงเทพมหานคร',
        '900'
    ],
    [
        'โรงเรียนสุรศักดิ์มนตรี',
        'ดินแดง',
        'เขตดินแดง',
        'กรุงเทพมหานคร',
        '1200 + 30 สำหรับผู้พิการ'
    ],
    ['โรงเรียนพระโขนงพิทยาลัย', 'บางจาก', 'เขตพระโขนง', 'กรุงเทพมหานคร', '510'],
    ['โรงเรียนวชิรธรรมสาธิต', 'บางจาก', 'เขตพระโขนง', 'กรุงเทพมหานคร', '750'],
    [
        'โรงเรียนมัธยมวัดธาตุทอง',
        'พระโขนงเหนือ',
        'เขตวัฒนา',
        'กรุงเทพมหานคร',
        '750'
    ],
    [
        'โรงเรียนสาธิตมหาวิทยาลัยศรีนครินทรวิโรฒ ประสานมิตร (ฝ่ายมัธยม)',
        'คลองเตยเหนือ',
        'เขตวัฒนา',
        'กรุงเทพมหานคร',
        '1230'
    ],
    ['โรงเรียนนครนายกวิทยาคม', 'นครนายก', 'เมืองนครนายก', 'นครนายก', '2070'],
    ['โรงเรียนพระนารายณ์', 'ท่าศาลา', 'เมืองลพบุรี', 'ลพบุรี', '1590'],
    ['โรงเรียนพิบูลวิทยาลัย', 'ทะเลชุบศร', 'เมืองลพบุรี', 'ลพบุรี', '2190'],
    [
        'โรงเรียนสระบุรีวิทยาคม',
        'ปากเพรียว',
        'เมืองสระบุรี',
        'สระบุรี',
        '2100 + 30 สำหรับผู้พิการ'
    ],
    ['โรงเรียนเมืองกระบี่', 'กระบี่ใหญ่', 'เมืองกระบี่', 'กระบี่', '1170'],
    ['โรงเรียนอำมาตย์พานิชนุกูล', 'ปากน้ำ', 'เมืองกระบี่', 'กระบี่', '1440'],
    ['โรงเรียนตรังคริสเตียนศึกษา', 'ทับเที่ยง', 'เมืองตรัง', 'ตรัง', '1200'],
    ['โรงเรียนวิเชียรมาตุ', 'โคกหล่อ', 'เมืองตรัง', 'ตรัง', '1890'],
    ['โรงเรียนสภาราชินี จังหวัดตรัง', 'ทับเที่ยง', 'เมืองตรัง', 'ตรัง', '1440'],
    ['โรงเรียนเดชะปัตตนยานุกูล', 'สะบารัง', 'เมืองปัตตานี', 'ปัตตานี', '1920'],
    [
        'โรงเรียนเบญจมราชูทิศ จังหวัดปัตตานี',
        'สะบารัง',
        'เมืองปัตตานี',
        'ปัตตานี',
        '1500'
    ],
    [
        'โรงเรียนสาธิตมหาวิทยาลัยสงขลานครินทร์',
        'รูสะมิแล',
        'เมืองปัตตานี',
        'ปัตตานี',
        '810'
    ],
    ['โรงเรียนดีบุกพังงาวิทยายน', 'ท้ายช้าง', 'เมืองพังงา', 'พังงา', '990'],
    ['โรงเรียนพัทลุง', 'คูหาสวรรค์', 'เมืองพัทลุง', 'พัทลุง', '1800'],
    ['โรงเรียนสตรีพัทลุง', 'คูหาสวรรค์', 'เมืองพัทลุง', 'พัทลุง', '1410'],
    ['โรงเรียนภูเก็ตวิทยาลัย', 'ตลาดใหญ่', 'เมืองภูเก็ต', 'ภูเก็ต', '2550'],
    ['โรงเรียนสตรีภูเก็ต', 'ตลาดใหญ่', 'เมืองภูเก็ต', 'ภูเก็ต', '1200'],
    [
        'โรงเรียนมหาวชิราวุธ จังหวัดสงขลา',
        'บ่อยาง',
        'เมืองสงขลา',
        'สงขลา',
        '1380'
    ],
    [
        'โรงเรียนวรนารีเฉลิม จังหวัดสงขลา',
        'บ่อยาง',
        'เมืองสงขลา',
        'สงขลา',
        '1530'
    ],
    [
        'โรงเรียนรร.เทศบาล 1 เอ็งเสียงสามัคคี',
        'หาดใหญ่',
        'หาดใหญ่',
        'สงขลา',
        '1200'
    ],
    ['โรงเรียนศรีนครมูลนิธิ', 'หาดใหญ่', 'หาดใหญ่', 'สงขลา', '990'],
    ['โรงเรียนหาดใหญ่วิทยาลัย', 'หาดใหญ่', 'หาดใหญ่', 'สงขลา', '2220'],
    ['โรงเรียนหาดใหญ่วิทยาลัย ๒', 'บ้านพรุ', 'หาดใหญ่', 'สงขลา', '1080'],
    [
        'โรงเรียนหาดใหญ่วิทยาลัยสมบูรณ์กุลกันยา',
        'หาดใหญ่',
        'หาดใหญ่',
        'สงขลา',
        '900'
    ],
    ['โรงเรียนพิมานพิทยาสรรค์', 'พิมาน', 'เมืองสตูล', 'สตูล', '1350'],
    ['โรงเรียนสตูลวิทยา', 'คลองขุด', 'เมืองสตูล', 'สตูล', '990'],
    [
        'โรงเรียนมัธยมวัดสิงห์',
        'บางขุนเทียน',
        'เขตจอมทอง',
        'กรุงเทพมหานคร',
        '1590'
    ],
    ['โรงเรียนวัดราชโอรส', 'บางค้อ', 'เขตจอมทอง', 'กรุงเทพมหานคร', '1320'],
    [
        'โรงเรียนโพธิสารพิทยากร',
        'บางระมาด',
        'เขตตลิ่งชัน',
        'กรุงเทพมหานคร',
        '1860'
    ],
    ['โรงเรียนศึกษานารี', 'วัดกัลยาณ์', 'เขตธนบุรี', 'กรุงเทพมหานคร', '1260'],
    [
        'โรงเรียนชิโนรสวิทยาลัย',
        'บ้านช่างหล่อ',
        'เขตบางกอกน้อย',
        'กรุงเทพมหานคร',
        '965'
    ],
    [
        'โรงเรียนรัตนโกสินทร์สมโภชบางขุนเทียน',
        'แสมดำ',
        'เขตบางขุนเทียน',
        'กรุงเทพมหานคร',
        '1590'
    ],
    ['โรงเรียนปัญญาวรคุณ', 'หลักสอง', 'เขตบางแค', 'กรุงเทพมหานคร', '900'],
    [
        'โรงเรียนวัดนวลนรดิศ',
        'ปากคลองภาษีเจริญ',
        'เขตภาษีเจริญ',
        'กรุงเทพมหานคร',
        '900'
    ],
    [
        'โรงเรียนบางปะกอกวิทยาคม',
        'บางปะกอก',
        'เขตราษฎร์บูรณะ',
        'กรุงเทพมหานคร',
        '1050'
    ],
    [
        'โรงเรียนวิทยาลัยพณิชยการเชตุพน',
        'บางปะกอก',
        'เขตราษฎร์บูรณะ',
        'กรุงเทพมหานคร',
        '750'
    ],
    [
        'โรงเรียนเทพศิรินทร์สมุทรปราการ',
        'บางเมือง',
        'เมืองสมุทรปราการ',
        'สมุทรปราการ',
        '1500'
    ],
    [
        'โรงเรียนสตรีสมุทรปราการ',
        'ปากน้ำ',
        'เมืองสมุทรปราการ',
        'สมุทรปราการ',
        '1800'
    ],
    [
        'โรงเรียนสมุทรปราการ',
        'ปากน้ำ',
        'เมืองสมุทรปราการ',
        'สมุทรปราการ',
        '1680'
    ],
    ['โรงเรียนบางกะปิ', 'คลองจั่น', 'เขตบางกะปิ', 'กรุงเทพมหานคร', '1260'],
    [
        'โรงเรียนมัธยมวัดบึงทองหลาง',
        'คลองจั่น',
        'เขตบางกะปิ',
        'กรุงเทพมหานคร',
        '900'
    ],
    [
        'โรงเรียนบดินทรเดชา (สิงห์ สิงหเสนี) ๒',
        'คลองกุ่ม',
        'เขตบึงกุ่ม',
        'กรุงเทพมหานคร',
        '1350'
    ],
    [
        'โรงเรียนเศรษฐบุตรบำเพ็ญ',
        'มีนบุรี',
        'เขตมีนบุรี',
        'กรุงเทพมหานคร',
        '2190'
    ],
    [
        'โรงเรียนสตรีเศรษฐบุตรบำเพ็ญ',
        'มีนบุรี',
        'เขตมีนบุรี',
        'กรุงเทพมหานคร',
        '1080'
    ],
    [
        'โรงเรียนเตรียมอุดมศึกษาพัฒนาการ',
        'สวนหลวง',
        'เขตสวนหลวง',
        'กรุงเทพมหานคร',
        '2070'
    ],
    [
        'โรงเรียนเตรียมอุดมศึกษาน้อมเกล้า',
        'สะพานสูง',
        'เขตสะพานสูง',
        'กรุงเทพมหานคร',
        '1140'
    ],
    ['โรงเรียนชัยภูมิภักดีชุมพล', 'ในเมือง', 'เมืองชัยภูมิ', 'ชัยภูมิ', '2010'],
    ['โรงเรียนสตรีชัยภูมิ', 'ในเมือง', 'เมืองชัยภูมิ', 'ชัยภูมิ', '1710'],
    ['โรงเรียนบุญวัฒนา', 'หัวทะเล', 'เมืองนครราชสีมา', 'นครราชสีมา', '1950'],
    [
        'โรงเรียนราชสีมาวิทยาลัย',
        'ในเมือง',
        'เมืองนครราชสีมา',
        'นครราชสีมา',
        '1800'
    ],
    [
        'โรงเรียนสุรธรรมพิทักษ์',
        'โพธิ์กลาง',
        'เมืองนครราชสีมา',
        'นครราชสีมา',
        '1260'
    ],
    [
        'โรงเรียนสุรนารีวิทยา',
        'ในเมือง',
        'เมืองนครราชสีมา',
        'นครราชสีมา',
        '2070'
    ],
    [
        'โรงเรียนอุบลรัตนราชกัญญาราชวิทยาลัย นครราชสีมา',
        'บ้านใหม่',
        'เมืองนครราชสีมา',
        'นครราชสีมา',
        '930'
    ],
    ['โรงเรียนบัวหลวงวิทยาคม', 'บ้านบัว', 'เมืองบุรีรัมย์', 'บุรีรัมย์', '750'],
    [
        'โรงเรียนบุรีรัมย์พิทยาคม',
        'ในเมือง',
        'เมืองบุรีรัมย์',
        'บุรีรัมย์',
        '1980'
    ],
    ['โรงเรียนภัทรบพิตร', 'เสม็ด', 'เมืองบุรีรัมย์', 'บุรีรัมย์', '810'],
    ['โรงเรียนสิรินธร', 'ในเมือง', 'เมืองสุรินทร์', 'สุรินทร์', '2340'],
    ['โรงเรียนสุรวิทยาคาร', 'ในเมือง', 'เมืองสุรินทร์', 'สุรินทร์', '1320'],
    ['โรงเรียนยโสธรพิทยาคม', 'ในเมือง', 'เมืองยโสธร', 'ยโสธร', '1770'],
    ['โรงเรียนกันทรลักษ์วิทยา', 'สังเม็ก', 'กันทรลักษ์', 'ศรีสะเกษ', '1200'],
    ['โรงเรียนขุขันธ์', 'ห้วยเหนือ', 'ขุขันธ์', 'ศรีสะเกษ', '1350'],
    [
        'โรงเรียนศรีสะเกษวิทยาลัย',
        'หนองครก',
        'เมืองศรีสะเกษ',
        'ศรีสะเกษ',
        '1320'
    ],
    ['โรงเรียนสตรีสิริเกศ', 'เมืองใต้', 'เมืองศรีสะเกษ', 'ศรีสะเกษ', '1715'],
    ['โรงเรียนอำนาจเจริญ', 'บุ่ง', 'เมืองอำนาจเจริญ', 'อำนาจเจริญ', '1770'],
    ['โรงเรียนเดชอุดม', 'เมืองเดช', 'เดชอุดม', 'อุบลราชธานี', '1470'],
    ['โรงเรียนมัธยมตระการพืชผล', 'ขุหลุ', 'ตระการพืชผล', 'อุบลราชธานี', '1140'],
    ['โรงเรียนพิบูลมังสาหาร', 'พิบูล', 'พิบูลมังสาหาร', 'อุบลราชธานี', '1110'],
    ['โรงเรียนนารีนุกูล', 'ในเมือง', 'เมืองอุบลราชธานี', 'อุบลราชธานี', '1380'],
    [
        'โรงเรียนเบ็ญจะมะมหาราช',
        'ในเมือง',
        'เมืองอุบลราชธานี',
        'อุบลราชธานี',
        '1620'
    ],
    [
        'โรงเรียนลือคำหาญวารินชำราบ',
        'แสนสุข',
        'วารินชำราบ',
        'อุบลราชธานี',
        '1380'
    ],
    [
        'โรงเรียนเตรียมอุดมศึกษาพัฒนาการ อุบลราชธานี',
        'ขามใหญ่',
        'เมืองอุบลราชธานี',
        'อุบลราชธานี',
        '900'
    ],
    [
        'โรงเรียนเบญจมราชูทิศ จังหวัดจันทบุรี',
        'วัดใหม่',
        'เมืองจันทบุรี',
        'จันทบุรี',
        '1050'
    ],
    ['โรงเรียนศรียานุสรณ์', 'วัดใหม่', 'เมืองจันทบุรี', 'จันทบุรี', '1050'],
    ['โรงเรียนดัดดรุณี', 'หน้าเมือง', 'เมืองฉะเชิงเทรา', 'ฉะเชิงเทรา', '960'],
    [
        'โรงเรียนเบญจมราชรังสฤษฎิ์',
        'หน้าเมือง',
        'เมืองฉะเชิงเทรา',
        'ฉะเชิงเทรา',
        '1500'
    ],
    ['โรงเรียนโพธิสัมพันธ์พิทยาคาร', 'นาเกลือ', 'บางละมุง', 'ชลบุรี', '1320'],
    ['โรงเรียนพนัสพิทยาคาร', 'กุฎโง้ง', 'พนัสนิคม', 'ชลบุรี', '900'],
    ['โรงเรียนชลกันยานุกูล', 'บางปลาสร้อย', 'เมืองชลบุรี', 'ชลบุรี', '1500'],
    ['โรงเรียนชลราษฎรอำรุง', 'บ้านสวน', 'เมืองชลบุรี', 'ชลบุรี', '1500'],
    [
        'โรงเรียนสาธิต พิบูลบำเพ็ญ มหาวิทยาลัยบูรพา',
        'แสนสุข',
        'เมืองชลบุรี',
        'ชลบุรี',
        '870'
    ],
    ['โรงเรียนศรีราชา', 'ศรีราชา', 'ศรีราชา', 'ชลบุรี', '1140'],
    ['โรงเรียนตราษตระการคุณ', 'วังกระแจะ', 'เมืองตราด', 'ตราด', '900'],
    ['โรงเรียนกบินทร์วิทยา', 'กบินทร์', 'กบินทร์บุรี', 'ปราจีนบุรี', '900'],
    [
        'โรงเรียนปราจิณราษฎรอำรุง',
        'หน้าเมือง',
        'เมืองปราจีนบุรี',
        'ปราจีนบุรี',
        '900'
    ],
    [
        'โรงเรียนปราจีนกัลยาณี',
        'หน้าเมือง',
        'เมืองปราจีนบุรี',
        'ปราจีนบุรี',
        '810'
    ],
    ['โรงเรียนแกลง วิทยสถาวร', 'ทางเกวียน', 'แกลง', 'ระยอง', '900'],
    ['โรงเรียนระยองวิทยาคม', 'ท่าประดู่', 'เมืองระยอง', 'ระยอง', '1050'],
    ['โรงเรียนระยองวิทยาคมปากน้ำ', 'ปากน้ำ', 'เมืองระยอง', 'ระยอง', '870'],
    ['โรงเรียนวัดป่าประดู่', 'ท่าประดู่', 'เมืองระยอง', 'ระยอง', '1020'],
    ['โรงเรียนสระแก้ว', 'สระแก้ว', 'เมืองสระแก้ว', 'สระแก้ว', '900'],
    ['โรงเรียนอรัญประเทศ', 'อรัญประเทศ', 'อรัญประเทศ', 'สระแก้ว', '900'],
    [
        'โรงเรียนกำแพงเพชรพิทยาคม',
        'ในเมือง',
        'เมืองกำแพงเพชร',
        'กำแพงเพชร',
        '1920'
    ],
    ['โรงเรียนชัยนาทพิทยาคม', 'บ้านกล้วย', 'เมืองชัยนาท', 'ชัยนาท', '1740'],
    ['โรงเรียนตากพิทยาคม', 'ระแหง', 'เมืองตาก', 'ตาก', '1590'],
    ['โรงเรียนสรรพวิทยาคม', 'แม่สอด', 'แม่สอด', 'ตาก', '1560'],
    ['โรงเรียนตาคลีประชาสรรค์', 'ตาคลี', 'ตาคลี', 'นครสวรรค์', '660'],
    ['โรงเรียนนครสวรรค์', 'ปากน้ำโพ', 'เมืองนครสวรรค์', 'นครสวรรค์', '2100'],
    [
        'โรงเรียนนวมินทราชูทิศ มัชฌิม',
        'นครสวรรค์ตก',
        'เมืองนครสวรรค์',
        'นครสวรรค์',
        '1410'
    ],
    ['โรงเรียนตะพานหิน', 'ตะพานหิน', 'ตะพานหิน', 'พิจิตร', '1530'],
    ['โรงเรียนพิจิตรพิทยาคม', 'ในเมือง', 'เมืองพิจิตร', 'พิจิตร', '1770'],
    ['มหาวิทยาลัยนเรศวร', 'ท่าโพธิ์', 'เมืองพิษณุโลก', 'พิษณุโลก', '3930'],
    ['โรงเรียนเพชรพิทยาคม', 'ในเมือง', 'เมืองเพชรบูรณ์', 'เพชรบูรณ์', '1860'],
    [
        'โรงเรียนวิทยานุกูลนารี',
        'ในเมือง',
        'เมืองเพชรบูรณ์',
        'เพชรบูรณ์',
        '2010'
    ],
    ['โรงเรียนหล่มสักวิทยาคม', 'หล่มสัก', 'หล่มสัก', 'เพชรบูรณ์', '2130'],
    ['โรงเรียนสุโขทัยวิทยาคม', 'บ้านกล้วย', 'เมืองสุโขทัย', 'สุโขทัย', '1740'],
    ['โรงเรียนสวรรค์อนันต์วิทยา', 'ย่านยาว', 'สวรรคโลก', 'สุโขทัย', '990'],
    ['โรงเรียนอุตรดิตถ์ดรุณี', 'ท่าอิฐ', 'เมืองอุตรดิตถ์', 'อุตรดิตถ์', '2190'],
    ['โรงเรียนอุทัยวิทยาคม', 'สะแกกรัง', 'เมืองอุทัยธานี', 'อุทัยธานี', '1830'],
    [
        'โรงเรียนกาฬสินธุ์พิทยาสรรพ์',
        'กาฬสินธุ์',
        'เมืองกาฬสินธุ์',
        'กาฬสินธุ์',
        '2100'
    ],
    ['โรงเรียนอนุกูลนารี', 'กาฬสินธุ์', 'เมืองกาฬสินธุ์', 'กาฬสินธุ์', '1920'],
    [
        'โรงเรียนสาธิตมหาวิทยาลัยมหาสารคาม (ฝ่ายมัธยม)',
        'ขามเรียง',
        'กันทรวิชัย',
        'มหาสารคาม',
        '1380'
    ],
    ['โรงเรียนผดุงนารี', 'ตลาด', 'เมืองมหาสารคาม', 'มหาสารคาม', '1500'],
    ['โรงเรียนสารคามพิทยาคม', 'ตลาด', 'เมืองมหาสารคาม', 'มหาสารคาม', '1500'],
    [
        'โรงเรียนร้อยเอ็ดวิทยาลัย',
        'ในเมือง',
        'เมืองร้อยเอ็ด',
        'ร้อยเอ็ด',
        '2520'
    ],
    ['โรงเรียนสตรีศึกษา', 'ในเมือง', 'เมืองร้อยเอ็ด', 'ร้อยเอ็ด', '2100'],
    ['โรงเรียนศรียาภัย', 'ท่าตะเภา', 'เมืองชุมพร', 'ชุมพร', '2940'],
    ['มหาวิทยาลัยวลัยลักษณ์', 'ไทยบุรี', 'ท่าศาลา', 'นครศรีธรรมราช', '5980'],
    ['โรงเรียนพิชัยรัตนาคาร', 'บางริ้น', 'เมืองระนอง', 'ระนอง', '1155'],
    [
        'โรงเรียนสุราษฎร์ธานี',
        'ตลาด',
        'เมืองสุราษฎร์ธานี',
        'สุราษฎร์ธานี',
        '1820'
    ],
    [
        'โรงเรียนสุราษฎร์พิทยา',
        'ตลาด',
        'เมืองสุราษฎร์ธานี',
        'สุราษฎร์ธานี',
        '2450'
    ],
    [
        'มหาวิทยาลัยนราธิวาสราชนครินทร์',
        'โคกเคียน',
        'เมืองนราธิวาส',
        'นราธิวาส',
        '3180'
    ],
    ['โรงเรียนคณะราษฎรบำรุง จังหวัดยะลา', 'สะเตง', 'เมืองยะลา', 'ยะลา', '1470'],
    ['โรงเรียนสตรียะลา', 'สะเตง', 'เมืองยะลา', 'ยะลา', '690'],
    ['โรงเรียนปิยะมหาราชาลัย', 'ในเมือง', 'เมืองนครพนม', 'นครพนม', '1860'],
    ['โรงเรียนมุกดาหาร', 'มุกดาหาร', 'เมืองมุกดาหาร', 'มุกดาหาร', '1410']
]

export const schools = locations.map(([school]) => school)

export default locations
