const subjects = [
    {
        day: ['วันพฤหัสบดี', '10 มี.ค 65'],
        subjects: [
            [['85 GAT', 'ความถนัดทั่วไป']],
            [['71 PAT 1', 'ความถนัดทางคณิตศาสตร์']]
        ]
    },
    {
        day: ['วันศุกร์', '11 มี.ค 65'],
        subjects: [
            [['72 PAT 2', 'ความถนัดทางวิทยาศาสตร์']],
            [['75 PAT 5', 'ความถนัดทางคณิตศาสตร์']]
        ]
    },
    {
        day: ['วันศุกร์', '12 มี.ค 65'],
        subjects: [
            [['73 PAT 3', 'ความถนัดทางวิศวกรรมศาสตร์']],
            [['74 PAT 4', 'ความถนัดทางทางสถาปัตยกรรมศาสตร์']]
        ]
    },
    {
        day: ['วันอาทิตย์', '13 มี.ค 65'],
        subjects: [
            [['76 PAT 6', 'ความถนัดทางศิลปกรรมศาสตร์']],
            [
                ['77 PAT 7.1', 'ความถนัดทางภาษาฝรั่งเศษ'],
                ['78 PAT 7.2', 'ความถนัดทางภาษาเยอรมัน'],
                ['79 PAT 7.3', 'ความถนัดทางภาษาญี่ปุ่น'],
                ['80 PAT 7.4', 'ความถนัดทางภาษาจีน'],
                ['81 PAT 7.5', 'ความถนัดทางภาษาอาหรับ'],
                ['82 PAT 7.6', 'ความถนัดทางภาษาบาลี'],
                ['83 PAT 7.7', 'ความถนัดทางภาษาเกาหลี']
            ]
        ]
    }
] as const

export const subjectToDate = {
    '85 GAT': '10 มี.ค 65',
    '71 PAT 1': '10 มี.ค 65',
    '72 PAT 2': '11 มี.ค 65',
    '75 PAT 5': '11 มี.ค 65',
    '73 PAT 3': '12 มี.ค 65',
    '74 PAT 4': '12 มี.ค 65',
    '76 PAT 6': '13 มี.ค 65',
    '77 PAT 7.1': '13 มี.ค 65',
    '78 PAT 7.2': '13 มี.ค 65',
    '79 PAT 7.3': '13 มี.ค 65',
    '80 PAT 7.4': '13 มี.ค 65',
    '81 PAT 7.5': '13 มี.ค 65',
    '82 PAT 7.6': '13 มี.ค 65',
    '83 PAT 7.7': '13 มี.ค 65',
}

export { locations, schools } from './components'
export default subjects
