const subjects = [
    {
        day: ['วันเสาร์', '12 มี.ค 65'],
        subjects: [
            [['85 GAT', 'ความถนัดทั่วไป']],
            [['71 PAT 1', 'ความถนัดทางคณิตศาสตร์']]
        ]
    },
    {
        day: ['วันอาทิตย์', '13 มี.ค 65'],
        subjects: [
            [['72 PAT 2', 'ความถนัดทางวิทยาศาสตร์']],
            [['75 PAT 5', 'ความถนัดทางคณิตศาสตร์']]
        ]
    },
    {
        day: ['วันจันทร์', '14 มี.ค 65'],
        subjects: [
            [['73 PAT 3', 'ความถนัดทางวิศวกรรมศาสตร์']],
            [['74 PAT 4', 'ความถนัดทางทางสถาปัตยกรรมศาสตร์']]
        ]
    },
    {
        day: ['วันอังคาร', '15 มี.ค 65'],
        subjects: [
            [['76 PAT 6', 'ความถนัดทางศิลปกรรมศาสตร์']],
            [
                ['77 PAT 7.1', 'ความถนัดทางภาษาฝรั่งเศษ'],
                ['78 PAT 7.2', 'ความถนัดทางภาษาเยอรมัน'],
                ['79 PAT 7.3', 'ความถนัดทางภาษาญี่ปุ่น'],
                ['80 PAT 7.4', 'ความถนัดทางภาษาจีน'],
                ['81 PAT 7.5', 'ความถนัดทางภาษาอาหรับ'],
                ['82 PAT 7.6', 'ความถนัดทางภาษาบาลี'],
                ['83 PAT 7.7', 'ความถนัดทางภาษาเกาหลี']
            ]
        ]
    }
] as const

export const normalSubjects = [
    {
        day: ['วันเสาร์', '19 มี.ค 65'],
        subjects: [
            [['69', 'ชีววิทยา']],
            [
                ['49', 'ฟิสิกส์'],
                ['99', 'วิทยาศาสตร์ทั่วไป']
            ],
            [['85', 'ภาษาไทย']],
            [['19', 'สังคมศึกษา']]
        ]
    },
    {
        day: ['วันอาทิตย์', '20 มี.ค 65'],
        subjects: [
            [
                ['39', 'คณิตศาสตร์ 1 (พื้นฐาน + เพิ่มเติม)'],
                ['89', 'คณิตศาสตร์ 2']
            ],
            [['29', 'ภาษาอังกฤษ']],
            [['59', 'เคมี']],
            []
        ]
    }
] as const

export const subjectToDate = {
    '85 GAT': '12 มี.ค 65',
    '71 PAT 1': '12 มี.ค 65',
    '72 PAT 2': '13 มี.ค 65',
    '75 PAT 5': '13 มี.ค 65',
    '73 PAT 3': '14 มี.ค 65',
    '74 PAT 4': '14 มี.ค 65',
    '76 PAT 6': '15 มี.ค 65',
    '77 PAT 7.1': '15 มี.ค 65',
    '78 PAT 7.2': '15 มี.ค 65',
    '79 PAT 7.3': '15 มี.ค 65',
    '80 PAT 7.4': '15 มี.ค 65',
    '81 PAT 7.5': '15 มี.ค 65',
    '82 PAT 7.6': '15 มี.ค 65',
    '83 PAT 7.7': '15 มี.ค 65',
    '69': '19 มี.ค 65',
    '49': '19 มี.ค 65',
    '99': '19 มี.ค 65',
    '85': '19 มี.ค 65',
    '19': '19 มี.ค 65',
    '39': '20 มี.ค 65',
    '89': '20 มี.ค 65',
    '29': '20 มี.ค 65',
    '59': '20 มี.ค 65'
}

export { locations, schools } from './components'
export default subjects
